MESSAGES = {
    "start": """سلام {} 👋🏼؛
<blockquote>این ربات به‌صورت هوشمند و مداوم، گیف‌های جدید تلگرام را بررسی می‌کند. هر زمان که گیف جدیدی منتشر شود، در صورتی که اشتراک فعال داشته باشید، از طریق پیامک به شما اطلاع داده خواهد شد تا هیچ‌کدام از گیف‌های جدید را از دست ندهید.</blockquote>
<blockquote>می‌توانید ربات را در گروه‌های مختلف عضو کنید تا هر زمان که گیفت جدیدی از سوی تلگرام منتشر شد، ربات به‌صورت خودکار اطلاع‌رسانی کرده و اعضای گروه را در جریان قرار دهد.</blockquote>
{}""",
    "support": "برای ارتباط با پشتیبانی، لطفا به آیدی زیر پیام دهید. پاسخگویی در سریع‌ترین زمان ممکن انجام خواهد شد:\n🆔 {}",
    "guide": """
**🛒 تهیه اشتراک:**
<blockquote>از این بخش می‌تونید اشتراک فعال تهیه کنید تا به‌محض اضافه شدن گیف‌های جدید، براتون پیامک ارسال بشه.</blockquote>
**👤 پشتیبانی:**
<blockquote>در صورت داشتن سؤال یا مشکل، می‌تونید از این بخش با پشتیبانی در تماس باشید.</blockquote>
**ℹ️ اطلاعات کاربر:**
<blockquote>در این قسمت می‌تونید اطلاعات حساب خودتون مثل وضعیت اشتراک، شماره ثبت‌شده و تاریخ انقضا رو ببینید.</blockquote>""",
    "info": """👤 **اطلاعات کاربر**
<blockquote>user-id: {}
receptor: {}
sender: {}
sub-count: {}
status: {} {}
token: {}</blockquote>
{}""",
    "user_not_found": '**‼️ شما اشتراک فعال ندارید! برای تهیه اشتراک روی دکمه "🛒 تهیه اشتراک" بزنید.**',
    "buy_subscription": """برای تهیه اشتراک در سایت زیر که ارائه دهنده خدمات پیامکی در ایران است، ثبت نام کنید:
<blockquote>https://console.kavenegar.com/membership/signup?redirect=/</blockquote>
سپس در صفحه اصلی سایت (یکم پایین تر) قطعه کد مربوط که حساب کاربری خودتون رو که یک نمونشو این پایین گذاشتیم، کپی کنید و به ربات ارسال کنید:
```javascript
var Kavenegar = require('kavenegar');
var api = Kavenegar.KavenegarApi({apikey: 'توکن شما'});
api.Send({ message: "خدمات پیام کوتاه کاوه نگار" , sender: "2000660110" , receptor: "شماره شما" });```
** با اینکار ربات میتواند بلافاصله بعد از منتشر شدن گیفت جدید، از طریق وب سرویس کاوه نگار به شماره شما پیامک ارسال کند!**""",
    "ask_subscription_count": """لطفاً تعداد اشتراک مورد نظر خود را با استفاده از کیبورد زیر انتخاب کنید:
<blockquote>برای مثال، اگر عدد ۱۰ را انتخاب کنید، هر بار که گیفت جدیدی در تلگرام منتشر شود، تا ۱۰ بار به شما اطلاع داده خواهد شد. اما پس از بار یازدهم، دیگر پیامی دریافت نمی‌کنید.  
توجه داشته باشید که تعداد گیفت‌ها در یک لحظه مهم نیست؛ اگر چندین گیفت همزمان منتشر شوند، فقط یک بار از اشتراک شما کم می‌شود، نه به تعداد گیفت‌ها. 
اگر به طور میانگین هر ماه یک گیفت منتشر شود، اشتراک ۱۰ تایی شما تقریباً برای ۱۰ ماه کافی خواهد بود.</blockquote>""",
    "invalid_code_snippet": '**‼️ لطفا از درست بودن قطعه کد اطمینان حاصل کنید. در صورت نیاز به کمک از طریق دکمه "👤 پشتیبانی" با پشتیبانی ارتباط بگیرید!**',
    "cancel": "**‼️ فرایند خرید اشتراک لغو شد!**",
    "payment_success": "پرداخت موفق! اشتراک {} شما فعال شد.",
    "subscription_ended": """کاربر عزیز؛
اشتراک شما به **پایان** رسیده است! از این پس هیچ پیامکی مبنی بر اضافه شدن گیفت جدید دریافت نمیکنید.""",
    "payment_notification": "**کاربر {} اشتراک {} تایی تهیه کرد.**",
    "description": """لطفا قبل از پرداخت از صحت اطلاعات وارد شده اطمینان حاصل کنید:
<blockquote expandable>📱 Receptor: {}
📤 Sender: {}
⭐ Subscription: {}
🔑 Token: {}
**🎁 برای خرید اشتراک "💰 پرداخت" تایی روی دکمه {} بزنید.**
</blockquote>"""

}

def get_text(key: str) -> str:
    if key not in MESSAGES:
        raise KeyError(f"Message with key '{key}' not found.")
    return MESSAGES[key]
